configuration/src/Catalogs/ВидыДеятельности/ВидыДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельности</name>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>АдминистративныеВопросыОбщее</name>
      <description>Административные вопросы</description>
    </items>
    <items>
      <name>АнализТребованийОбщее</name>
      <description>Анализ требований</description>
    </items>
    <items>
      <name>АнализТребованийЗаказчика</name>
      <description>Анализ требований заказчика</description>
    </items>
    <items>
      <name>ИзучениеОбщее</name>
      <description>Изучение</description>
    </items>
    <items>
      <name>ИзучениеТехническойЗадачи</name>
      <description>Изучение технической задачи</description>
    </items>
    <items>
      <name>КонсультацияПользователей</name>
      <description>Консультация пользователей</description>
    </items>
    <items>
      <name>КонсультацияПользователейОбщее</name>
      <description>Консультация пользователей</description>
    </items>
    <items>
      <name>ОбсуждениеИзменений</name>
      <description>Обсуждение изменений</description>
    </items>
    <items>
      <name>ПодготовкаАрхитектуры</name>
      <description>Подготовка архитектуры</description>
    </items>
    <items>
      <name>ПодготовкаДокументацииОбщее</name>
      <description>Подготовка документации</description>
    </items>
    <items>
      <name>ПодготовкаДокументации</name>
      <description>Подготовка документации</description>
    </items>
    <items>
      <name>ПодготовкаТехническогоЗаданияОбщее</name>
      <description>Подготовка технического задания</description>
    </items>
    <items>
      <name>ПроектированиеОбщее</name>
      <description>Проектирование</description>
    </items>
    <items>
      <name>РеализацияИзменений</name>
      <description>Реализация изменений</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
    <items>
      <name>ТестированиеОбщее</name>
      <description>Тестирование</description>
    </items>
    <items>
      <name>ТехническиеРаботы</name>
      <description>Технические работы</description>
    </items>
  </predefined>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияВидовДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляСобрания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Enums/НазначенияВидовДеятельности/НазначенияВидовДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияВидовДеятельности</name>
  <enumValues>
    <name>Общее</name>
  </enumValues>
  <enumValues>
    <name>ITПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеТрудозатраты</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/ВидыДеятельности/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВнутренниеТрудозатраты") Тогда
		Объект.Назначение = Перечисления.НазначенияВидовДеятельности.ВнутренниеТрудозатраты;
	КонецЕсли;
	
	ДополнительныеРеквизиты.ПодключитьДополнительныеРеквизиты(Объект.Ссылка, ЭтотОбъект, 
		"ГруппаДополнительныеРеквизиты", "ГруппаДопРеквизитыНаФорме");

КонецПроцедуры
 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	ДополнительныеРеквизиты.ПередЗаписьюОбъекта(ЭтотОбъект, ТекущийОбъект); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	
	ДополнительныеРеквизитыКлиент.ПередЗакрытиемФормы(ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ОткрытьДополнительныеРеквизиты(Команда)

	ДополнительныеРеквизитыКлиент.ОткрытьФормуДополнительныхРеквизитов(Объект.Ссылка, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	Если Объект.Назначение = Перечисления.НазначенияВидовДеятельности.ВнутренниеТрудозатраты Тогда
		Элементы.Назначение.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Назначение.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
